Repository: Symb0x76/bTranslator
Catalog: src/bTranslator.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# AiCopilotProviderChainHeader.Text
source: Model
zh_cn: 模型

# AiCopilotMcpHint.Text
source: Tip: /mcp translate-mod --save to localize and save quickly.
zh_cn: 提示：使用 /mcp translate-mod --save 可一键汉化并保存。

# AiCopilotInputBox.PlaceholderText
source: Ask for translation help or run /mcp commands...
zh_cn: 输入翻译问题，或使用 /mcp 命令直接执行...

# AiCopilotSendButton.Content
source: Send
zh_cn: 发送

# AiCopilotClearButton.Content
source: Clear
zh_cn: 清空

# AiCopilotBusy.Text
source: Thinking...
zh_cn: 思考中...

# AiCopilot.WelcomeMessage
source: Copilot is ready. Use /mcp help to view tool commands for direct mod localization.
zh_cn: Copilot 已就绪。输入 /mcp help 查看可直接汉化 MOD 的工具命令。

# AiCopilot.UserRoleLabelText
source: You
zh_cn: 你

# AiCopilot.McpTranslateRowFailed
source: MCP translate-row failed. Check status panel for details.
zh_cn: MCP translate-row 执行失败，请查看状态栏。

# AiCopilot.McpNextPendingDone
source: Moved selection to next pending row.
zh_cn: 已跳转到下一条待翻译行。

# AiCopilot.McpLocalizeAndSaveDone
source: MCP localized {0} rows and saved workspace.
zh_cn: MCP 已汉化 {0} 行并保存工作区。

# AiCopilot.McpLocalizeDone
source: MCP localized {0} rows. Run /mcp save to persist output.
zh_cn: MCP 已汉化 {0} 行。可执行 /mcp save 保存输出。

# AiCopilot.McpUnknownCommand
source: Unknown MCP command: '{0}'. Use /mcp help.
zh_cn: 未知 MCP 命令：'{0}'。请使用 /mcp help。

# AiCopilot.McpOpenUsage
source: Usage: /mcp open <plugin-path>
zh_cn: 用法：/mcp open <plugin-path>

# AiCopilot.McpOpenPathMissing
source: Plugin path not found: {0}
zh_cn: 未找到插件路径：{0}

# AiCopilot.NoProviderAvailable
source: No model selected. Choose one from the model selector.
zh_cn: 未选择模型，请在模型下拉框中选择一个。

# AiCopilot.EmptyReply
source: Provider returned an empty reply. Check provider model/prompt settings.
zh_cn: Provider 返回空回复，请检查模型或提示词配置。

# AiCopilot.McpStatusSummary
source: Workspace={0}; Rows total={1}, pending={2}; Selected={3}; Model={4}.
zh_cn: 工作区={0}；总行数={1}，待翻译={2}；当前选中={3}；模型={4}。

# AiCopilot.McpHelpText
source: MCP commands: /mcp status /mcp open <plugin-path> /mcp translate-row /mcp translate-mod [--save] /mcp save /mcp next
zh_cn: MCP 命令： /mcp status /mcp open <plugin-path> /mcp translate-row /mcp translate-mod [--save] /mcp save /mcp next

# Status.AiCopilotError
source: Copilot request failed: {0}
zh_cn: Copilot 请求失败：{0}

# Status.AiCopilotLlmFailed
source: LLM chat failed: {0}
zh_cn: LLM 对话失败：{0}

# Status.NoSelectedRow
source: No selected row.
zh_cn: 未选中任何行。

# Status.RowLockedCannotTranslate
source: Selected row is locked. Unlock it before AI translation.
zh_cn: 当前行已锁定，请先解锁再进行 AI 翻译。

# Status.RowTranslationDone
source: Translated selected row '{0}' via '{1}'.
zh_cn: 已通过 '{1}' 翻译选中行 '{0}'。

# Status.RowTranslationFailed
source: Selected row translation failed: {0}
zh_cn: 选中行翻译失败：{0}

# Log.AiCopilotProviderReply
source: Copilot response generated via '{0}'.
zh_cn: Copilot 回复由 '{0}' 生成。
